<a href="https://colab.research.google.com/github/sagarsitap596/gcolab_python/blob/master/pandas_guided_project_ca_questions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Sales report using Pandas
***
## Problem Statement

Hello budding Data Scientists. We have with us a bank data set which gives information about the revenue of various customers spread across different regions in USA.

Using the knowledge of Pandas and Matplotlib, we will try to answer certain questions from the bank dataset  

We will also then scrape certain additional data from Wikipedia, clean it and combine it with our bank data for better understandability of the data.      


## About the Dataset

Preview of the dataset 

![bank_dataset](../images/bank_data.png)

The dataset has details of 15 customers with following 9 features.

|Feature|Description|
|-----|-----|
|account|account Id|
|name|name of the person|
|street|Name of the street|
|city|Name of the city|
|state|Name of the state|
|postal-code|numerical value|
|Jan|Amount in doller|
|Feb|Amount in doller|
|Mar|Amount in doller|




## Why solve this project

Doing this project will enable you to integrate Multiple data sources to answer basic questions. You will also learn to perform common excel tasks with pandas

What will you learn in the session ?
Python Basics
Pandas
Web Scrapping
Functions
Plotting
Pre-requisites
Working knowledge of Pandas, Numpy, Matplotlib
Data indexing and slicing

# Load Data and Compute total
The first step - you know the drill by now - load the dataset and see how it looks like. Additionally, calculate the total amount in the first quarter of the financial year. Calculate the total amount of all the users for the month of jan, feb and Mar and also grand total. 
  

## Instructions

- Load dataset using pandas read_csv api in variable `df` and give file path as `path`.
- The names of the states `state` column are changed to lower case and store it in `df['state']`
- Create a new column named `total` which computes the total amount in the first quarter
  of the financial year i.e. for the months of Jan, Feb and Mar and store it in `df['total']`
- Calculate the sum of amount of all users in the Month of Jan, Feb, March and store it in variable `sum_row` 
 (Here the sum implies the sum of all the entries in the `Jan Column`, sum of entries in `Feb` Column and Grand total stands for the sum of entries in the column `total`)
- Append this computed sum to the DataFrame `df_final`

In [52]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Code starts here
df = pd.read_csv('/content/excel-comp-data.csv')

df['state'] = df['state'].str.lower()

df['total'] = df['Jan']+df['Feb']+df['Mar']

jan_sum = df['Jan'].sum()
feb_sum = df['Feb'].sum()
mar_sum = df['Mar'].sum()
tot = df['total'].sum()

df_final = df.append({'Jan':jan_sum,'Feb':feb_sum,'Mar':mar_sum,'total':tot},ignore_index=True)
df_final
#Code ends here

     account                              name  ...       Mar      total
0   211829.0        Kerluke, Koepp and Hilpert  ...   35000.0   107000.0
1   320563.0                    Walter-Trantow  ...   35000.0   175000.0
2   648336.0        Bashirian, Kunde and Price  ...   35000.0   246000.0
3   109996.0       D'Amore, Gleichner and Bode  ...   10000.0   175000.0
4   121213.0                     Bauch-Goldner  ...   35000.0   317000.0
5   132971.0  Williamson, Schumm and Hettinger  ...   35000.0   305000.0
6   145068.0                        Casper LLC  ...   70000.0   252000.0
7   205217.0                  Kovacek-Johnston  ...   35000.0   275000.0
8   209744.0                    Champlin-Morar  ...   35000.0   200000.0
9   212303.0                    Gerhold-Maggio  ...   35000.0   225000.0
10  214098.0       Goodwin, Homenick and Jerde  ...   55000.0   220000.0
11  231907.0                        Hahn-Moore  ...  162000.0   322000.0
12  242368.0      Frami, Anderson and Donnelly  ...   35000.0   317000.0
13  268755.0                       Walsh-Haley  ...   35000.0   210000.0
14  273274.0                     McDermott PLC  ...   70000.0   340000.0
15       NaN                               NaN  ...  717000.0  3686000.0

[16 rows x 10 columns]

# Scrape Data From the web 

Here, you will be scraping data from the web and cleaning it. 
 
  
## Instructions:

- Scrapes the url `https://en.wikipedia.org/wiki/List_of_U.S._state_abbreviations` and store it in variable `url`
- Use module `requests` to `get` the url and store it in variable called `response`
- load the html file in dataframe `df1`. `Note`:use `pd.read_html(response.content)[0]`.   
- First few rows consists of unclean data. You need to select rows from index 11 till end. Make the values at index 11 as column headers and store it in dataframe `df1`.
- Remove space from the column named 'United States of America' and store the result in dataframe called `df1['United States of America']`

In [38]:
import requests

# Code starts here
url = "https://en.wikipedia.org/wiki/List_of_U.S._state_abbreviations"
response = requests.get(url)
df1 = pd.read_html(response.content)[0]

df1.columns = df1.iloc[10,:]

df1 = df1.iloc[11:,:]

df1['United States of America'] = df1['United States of America'].str.strip()

df1.head(10)
# Code ends here

10 United States of America     Federal state  ...    U.S.      U.S.A.
11                  Alabama             State  ...    Ala.         NaN
12                   Alaska             State  ...  Alaska       Alas.
13                  Arizona             State  ...   Ariz.         Az.
14                 Arkansas             State  ...    Ark.         NaN
15               California             State  ...  Calif.   Ca., Cal.
16                 Colorado             State  ...   Colo.        Col.
17              Connecticut             State  ...   Conn.         Ct.
18                 Delaware             State  ...    Del.         De.
19     District of Columbia  Federal district  ...    D.C.  Wash. D.C.
20                  Florida             State  ...    Fla.  Fl., Flor.

[10 rows x 10 columns]

# Mapping Countries to their abbreviations

Using the data scraped from the previous task, map abbriviation to the name of states.
 
  

## Instructions:
 
- Using the scraped data create a variable called `mapping` which has the Country
 as key and Abbreviation as value
- Create a new column called `abbr` as the 7th column (index = 6) of the DataFrame `df_final`
- map the `df_final['state']` on variable `mapping` and store it in `df_final['abbr']`

In [68]:
# Code Starts here
mapping  = {k:v for k,v in zip(df1['United States of America'],df1['US'])}

print(set(df['state']).intersection(set(mapping.keys())))
# print(list(mapping.keys()))

# # df.insert(6,'abbr',np.NaN)
# df['abbr'] = df['state'].map(mapping)

# df[df['abbr'].notna()]
# # Code ends here

# print(mapping.keys)
# df_final.head(2)

set()

# Filling in the Missing Values

What you will notice in the previous task is that for two states Mississippi and Tennessee will have NaN values in column `abbr`. In this task you will be filling those missing values manually. 
 
  

## Intructions :  
- Locate the NaN in the abbr and replace `mississipi` with `MS` and store it in `df_mississipi`
- Locate the NaN in the abbr and replace `tenessee` with `TN` and store it in `df_tenessee`
- update the df_final

In [0]:
# Code starts here


# Code ends here

## Total amount bank hold  


Here, use the newly created abbr column to understand the total amount that the bank holds in each state. Let us make this data frame more readable by introducing units in this case `$` sign representing the unit of mone
 
  

## Instructions :
  
- Groups by `abbr` and finds the sum of aabr,jan,feb ,mar and total store the result in `df_sub`
- Write a `lambda function` to introduce `$` sign infromt of all the numbers using `applymap` and store the result in `formatted_df`

In [0]:
# Code starts here


# Code ends here

# Append a row to the DataFrame

In this task, you will append a row to the data frame which will give us information about the total amount of the various regions in Jan, Feb and march and also the grand total
 
## Instructions :

- Computes the sum of amount of all users in the Month of Jan, Feb, March and the  total in variable called `sum_row` 
 (Here the sum implies the sum of all the entries in the `Jan Column`, sum of entries in `Feb` Column and Grand total stands for the sum of entries in the column `total`)
- Tranpose the dataframe `sum_row` and store it in new dataframe `df_sub_sum` 
- Make sure you append the `$` to all the digits and store it in dataframe `df_sub_sum` .
- Append this computed sum to the DataFrame `final_table` 
- rename the index of `final_table` to  `{0: "Total"}`

In [0]:
# Code starts here


# Code ends here

# Pie chart for total


Having prepared all the data now its time to present the results visually
 
## Instructions :
- add the total of all the three months and store it in variable called `df_sub['total']`
- plot the pie chart for the `df_sub['total']`

In [0]:
# Code starts here


# Code ends here